---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarHandlesData
source: html/17deb694-c119-28df-d987-3f09da856d2b.htm
---
# RebarHandlesData Properties

Specifies whether the .NET object represents a valid Revit entity.